xml.xml

<SOAP-ENV:Envelope
	xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP-ENV:Body>
		<EMInteractions
			xmlns="http://schemas.ericsson.se/enterprise/mecs/eemm">
			<EMInteraction>
				<GenericRequest>
					<TargetSystem>MP</TargetSystem>
					<TaskObject>java:global/mp/mp.jar/SubSystemBean!se.ericsson.ebc.emtsn.ejb.GenericManagerLocal</TaskObject>
					<Action>CHANGE</Action>
				</GenericRequest>
				<GenericResponse/>
				<Tokens>
					<UserID>jella</UserID>
					<Password>Diavox!23</Password>
					<ApplicationID>diavox</ApplicationID>
					<OnBehalfOf>diavox</OnBehalfOf>
					<SessionID>A62F02F967C9EA06137EA466669D8BCD</SessionID>
					<TransactionID>1</TransactionID>
				</Tokens>
				<EMType>
					<MP>
						<FeatureLevel_VOs/>
						<User_VOs>
							<User_VO>
								<UserId>jella</UserId>
								<SecurityProfile>
									<SecurityProfileId>9</SecurityProfileId>
									<SecurityProfileName>Local Super User</SecurityProfileName>
								</SecurityProfile>
							</User_VO>
						</User_VOs>
						<SubSystem_VOs>
							<SubSystem_VO>
								<SubSystem>
									<SubSystemId>4</SubSystemId>
									<SubSystemName>lim1</SubSystemName>
								</SubSystem>
								<Version>070500</Version>
								<ServiceSystem>
									<Action>CHANGE</Action>
									<TSA>
										<GenericResponse>
											<Info>
												<ID>lim1</ID>
												<OK>false</OK>
												<Reason>MP.REASON.CONNECTION_ERROR</Reason>
												<Parameter>
													<FieldName>MP.PARAM.SubSystem_VOs.SubSystemName</FieldName>
													<Value>lim1</Value>
												</Parameter>
												<Message>MP.MESSAGE.SEE_LOGFILE_FOR_MORE_INFO</Message>
											</Info>
										</GenericResponse>
									</TSA>
								</ServiceSystem>
							</SubSystem_VO>
						</SubSystem_VOs>
						<GenericResponse>
							<Info>
								<ID>lim1</ID>
								<OK>true</OK>
								<Component>MP</Component>
							</Info>
						</GenericResponse>
					</MP>
				</EMType>
			</EMInteraction>
		</EMInteractions>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>